Revit 2027 API
ExecutedEventArgs.SetJournalData Method
 Sets the journal data associated to this command (on journal playback).
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetJournalData(
	IDictionary<string, string> data
)
Public Sub SetJournalData (
	data As IDictionary(Of String, String)
)
public:
void SetJournalData(
	IDictionary<String^, String^>^ data
)
member SetJournalData :
        data : IDictionary<string, string> -> unit
Parameters
data IDictionary<String, String>
Remarks
 For details about the use of journal data associated to a command, see ExternalCommandData.JournalData.
See Also
Reference
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace